Important update! Fixed some bugs to make the program feasible
